Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.IsNameUnique(System.String)
Determines whether a potential space type name is unique.
name:
The candidate name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.IsNameUnique(Autodesk.Revit.DB.Document,System.String)
Determines whether a potential space type name is unique.
document:
The document.
name:
The candidate name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a space type.
document:
The document.
name:
The space type name.
Returns:
The new space type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a space type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.SpaceTypeName
The space type name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters.
-or-
When setting this property: The given value for name is already in use as a space type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.IsPlenum
True if the space type is plenum.
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadSpaceType
The type element of space.
Since:
2018